app/controllers/todo_items_controller.rb

SELECT "todo_items".* FROM "todo_items"
---
  def index
    @todo_items = TodoItem.all

INSERT INTO "todo_items" ("description", "star", "check", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Implement Jquery on portfolio site"], ["star", "t"], ["check", "f"], ["created_at", "2015-05-27 00:29:05.034980"], ["updated_at", "2015-05-27 00:29:05.034980"]]
---
  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save

UPDATE "todo_items" SET "description" = ?, "star" = ?, "check" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["description", "Homework"], ["star", "f"], ["check", "f"], ["updated_at", "2015-05-18 19:34:20.162694"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)